Training/Solvers/laminarSolverUnsteady/run/pyrolysisReactor/01-mesh-coarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       laminarSolverUnsteady;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           2.00;

deltaT            1e-6;

writeControl      adjustableRunTime;

writeInterval     0.1;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  uncompressed;

timeFormat        general;

timePrecision     6;

runTimeModifiable yes;

adjustTimeStep    yes;

maxCo             0.4;

// ************************************************************************* //

