Training/Solvers/laminarSolverUnsteady/run/pyrolysisReactor/01-mesh-coarse/constant/solverOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solverOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Kinetics
{
	folder	   		"../../../../../../PreProcessing/POLIMI_CH4_Pyrolysis/kinetics-POLIMI_CH4_Pyrolysis";
	inertSpecies 		N2;
	ODESolver		SIBS;
}

Spark
{
	spark 		off;
	position    	(0 0 0);
	time		0.;
	temperature 	2200;
	duration 	0.025;
	diameter 	1.5e-3;
}

// ************************************************************************* //
