Training/Solvers/laminarSolverUnsteady/run/pyrolysisReactor/01-mesh-coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325.;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    adiabaticWall
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    outlet
    {
	type            fixedValue;
        value           uniform 101325.;
    }
    axis
    {
	type		symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
